nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/devices/cc13x2x7_cc26x2x7/inc/hw_aux_sysif.h
// Field:     [0] PROG_WU0
//
// Programmable wakeup flag 0.
//
// 0: No effect.
// 1: Clear WUFLAGS.PROG_WU0. Keep high until WUFLAGS.PROG_WU0 is 0.
//
// The wakeup flag becomes edge sensitive if you write PROG_WU0 to 0 when
// PROGWU0CFG.EN is 1.
// The wakeup flag becomes level sensitive if you write PROG_WU0 to 0 when
// PROGWU0CFG.EN is 0, then set PROGWU0CFG.EN.
#define AUX_SYSIF_WUFLAGSCLR_PROG_WU0                               0x00000001
#define AUX_SYSIF_WUFLAGSCLR_PROG_WU0_BITN                                   0
#define AUX_SYSIF_WUFLAGSCLR_PROG_WU0_M                             0x00000001
#define AUX_SYSIF_WUFLAGSCLR_PROG_WU0_S                                      0

//*****************************************************************************
//
// Register: AUX_SYSIF_O_WUGATE
//
//*****************************************************************************
// Field:     [0] EN
//
// Wakeup output enable.
//
// 0: Disable AUX wakeup output.
// 1: Enable AUX wakeup output.
#define AUX_SYSIF_WUGATE_EN                                         0x00000001
#define AUX_SYSIF_WUGATE_EN_BITN                                             0
#define AUX_SYSIF_WUGATE_EN_M                                       0x00000001
#define AUX_SYSIF_WUGATE_EN_S                                                0

//*****************************************************************************
//
// Register: AUX_SYSIF_O_VECCFG0
//
//*****************************************************************************
// Field:   [3:0] VEC_EV
//
// Select trigger event for vector 0.
//
// Non-enumerated values are treated as NONE.
// ENUMs:
// AON_RTC_CH2_DLY          AUX_EVCTL:EVSTAT2.AON_RTC_CH2_DLY
// SW_WU3                   WUFLAGS.SW_WU3
// SW_WU2                   WUFLAGS.SW_WU2
// SW_WU1                   WUFLAGS.SW_WU1
// SW_WU0                   WUFLAGS.SW_WU0
// PROG_WU3                 WUFLAGS.PROG_WU3
// PROG_WU2                 WUFLAGS.PROG_WU2
// PROG_WU1                 WUFLAGS.PROG_WU1
// PROG_WU0                 WUFLAGS.PROG_WU0
// NONE                     Vector is disabled.
#define AUX_SYSIF_VECCFG0_VEC_EV_W                                           4
#define AUX_SYSIF_VECCFG0_VEC_EV_M                                  0x0000000F
#define AUX_SYSIF_VECCFG0_VEC_EV_S                                           0
#define AUX_SYSIF_VECCFG0_VEC_EV_AON_RTC_CH2_DLY                    0x00000009
#define AUX_SYSIF_VECCFG0_VEC_EV_SW_WU3                             0x00000008
#define AUX_SYSIF_VECCFG0_VEC_EV_SW_WU2                             0x00000007
#define AUX_SYSIF_VECCFG0_VEC_EV_SW_WU1                             0x00000006
#define AUX_SYSIF_VECCFG0_VEC_EV_SW_WU0                             0x00000005
#define AUX_SYSIF_VECCFG0_VEC_EV_PROG_WU3                           0x00000004
#define AUX_SYSIF_VECCFG0_VEC_EV_PROG_WU2                           0x00000003
#define AUX_SYSIF_VECCFG0_VEC_EV_PROG_WU1                           0x00000002
#define AUX_SYSIF_VECCFG0_VEC_EV_PROG_WU0                           0x00000001
#define AUX_SYSIF_VECCFG0_VEC_EV_NONE                               0x00000000

//*****************************************************************************
//
// Register: AUX_SYSIF_O_VECCFG1
//
//*****************************************************************************
// Field:   [3:0] VEC_EV
//
// Select trigger event for vector 1.
//
// Non-enumerated values are treated as NONE.
// ENUMs:
// AON_RTC_CH2_DLY          AUX_EVCTL:EVSTAT2.AON_RTC_CH2_DLY
// SW_WU3                   WUFLAGS.SW_WU3
// SW_WU2                   WUFLAGS.SW_WU2
// SW_WU1                   WUFLAGS.SW_WU1
// SW_WU0                   WUFLAGS.SW_WU0
// PROG_WU3                 WUFLAGS.PROG_WU3
// PROG_WU2                 WUFLAGS.PROG_WU2
// PROG_WU1                 WUFLAGS.PROG_WU1
// PROG_WU0                 WUFLAGS.PROG_WU0
// NONE                     Vector is disabled.
#define AUX_SYSIF_VECCFG1_VEC_EV_W                                           4
#define AUX_SYSIF_VECCFG1_VEC_EV_M                                  0x0000000F
#define AUX_SYSIF_VECCFG1_VEC_EV_S                                           0
#define AUX_SYSIF_VECCFG1_VEC_EV_AON_RTC_CH2_DLY                    0x00000009
#define AUX_SYSIF_VECCFG1_VEC_EV_SW_WU3                             0x00000008
#define AUX_SYSIF_VECCFG1_VEC_EV_SW_WU2                             0x00000007
#define AUX_SYSIF_VECCFG1_VEC_EV_SW_WU1                             0x00000006
#define AUX_SYSIF_VECCFG1_VEC_EV_SW_WU0                             0x00000005
#define AUX_SYSIF_VECCFG1_VEC_EV_PROG_WU3                           0x00000004
#define AUX_SYSIF_VECCFG1_VEC_EV_PROG_WU2                           0x00000003
#define AUX_SYSIF_VECCFG1_VEC_EV_PROG_WU1                           0x00000002
#define AUX_SYSIF_VECCFG1_VEC_EV_PROG_WU0                           0x00000001
#define AUX_SYSIF_VECCFG1_VEC_EV_NONE                               0x00000000

//*****************************************************************************
//
// Register: AUX_SYSIF_O_VECCFG2
//
//*****************************************************************************
// Field:   [3:0] VEC_EV
//
// Select trigger event for vector 2.
//
// Non-enumerated values are treated as NONE.
// ENUMs:
// AON_RTC_CH2_DLY          AUX_EVCTL:EVSTAT2.AON_RTC_CH2_DLY
// SW_WU3                   WUFLAGS.SW_WU3
// SW_WU2                   WUFLAGS.SW_WU2
// SW_WU1                   WUFLAGS.SW_WU1
// SW_WU0                   WUFLAGS.SW_WU0
// PROG_WU3                 WUFLAGS.PROG_WU3
// PROG_WU2                 WUFLAGS.PROG_WU2
// PROG_WU1                 WUFLAGS.PROG_WU1
// PROG_WU0                 WUFLAGS.PROG_WU0
// NONE                     Vector is disabled.
#define AUX_SYSIF_VECCFG2_VEC_EV_W                                           4
#define AUX_SYSIF_VECCFG2_VEC_EV_M                                  0x0000000F
#define AUX_SYSIF_VECCFG2_VEC_EV_S                                           0
#define AUX_SYSIF_VECCFG2_VEC_EV_AON_RTC_CH2_DLY                    0x00000009
#define AUX_SYSIF_VECCFG2_VEC_EV_SW_WU3                             0x00000008
#define AUX_SYSIF_VECCFG2_VEC_EV_SW_WU2                             0x00000007
#define AUX_SYSIF_VECCFG2_VEC_EV_SW_WU1                             0x00000006
#define AUX_SYSIF_VECCFG2_VEC_EV_SW_WU0                             0x00000005
#define AUX_SYSIF_VECCFG2_VEC_EV_PROG_WU3                           0x00000004
#define AUX_SYSIF_VECCFG2_VEC_EV_PROG_WU2                           0x00000003
#define AUX_SYSIF_VECCFG2_VEC_EV_PROG_WU1                           0x00000002
#define AUX_SYSIF_VECCFG2_VEC_EV_PROG_WU0                           0x00000001
#define AUX_SYSIF_VECCFG2_VEC_EV_NONE                               0x00000000

//*****************************************************************************
//
// Register: AUX_SYSIF_O_VECCFG3
//
//*****************************************************************************
// Field:   [3:0] VEC_EV
//
// Select trigger event for vector 3.
//
// Non-enumerated values are treated as NONE.
// ENUMs:
// AON_RTC_CH2_DLY          AUX_EVCTL:EVSTAT2.AON_RTC_CH2_DLY
// SW_WU3                   WUFLAGS.SW_WU3
// SW_WU2                   WUFLAGS.SW_WU2
// SW_WU1                   WUFLAGS.SW_WU1
// SW_WU0                   WUFLAGS.SW_WU0
// PROG_WU3                 WUFLAGS.PROG_WU3
// PROG_WU2                 WUFLAGS.PROG_WU2
// PROG_WU1                 WUFLAGS.PROG_WU1
// PROG_WU0                 WUFLAGS.PROG_WU0
// NONE                     Vector is disabled.
#define AUX_SYSIF_VECCFG3_VEC_EV_W                                           4
#define AUX_SYSIF_VECCFG3_VEC_EV_M                                  0x0000000F
#define AUX_SYSIF_VECCFG3_VEC_EV_S                                           0
#define AUX_SYSIF_VECCFG3_VEC_EV_AON_RTC_CH2_DLY                    0x00000009
#define AUX_SYSIF_VECCFG3_VEC_EV_SW_WU3                             0x00000008
#define AUX_SYSIF_VECCFG3_VEC_EV_SW_WU2                             0x00000007
#define AUX_SYSIF_VECCFG3_VEC_EV_SW_WU1                             0x00000006
#define AUX_SYSIF_VECCFG3_VEC_EV_SW_WU0                             0x00000005
#define AUX_SYSIF_VECCFG3_VEC_EV_PROG_WU3                           0x00000004
#define AUX_SYSIF_VECCFG3_VEC_EV_PROG_WU2                           0x00000003
#define AUX_SYSIF_VECCFG3_VEC_EV_PROG_WU1                           0x00000002
#define AUX_SYSIF_VECCFG3_VEC_EV_PROG_WU0                           0x00000001
#define AUX_SYSIF_VECCFG3_VEC_EV_NONE                               0x00000000

//*****************************************************************************
//
// Register: AUX_SYSIF_O_VECCFG4
//
//*****************************************************************************
// Field:   [3:0] VEC_EV
//
// Select trigger event for vector 4.
//
// Non-enumerated values are treated as NONE.
// ENUMs:
// AON_RTC_CH2_DLY          AUX_EVCTL:EVSTAT2.AON_RTC_CH2_DLY
// SW_WU3                   WUFLAGS.SW_WU3
// SW_WU2                   WUFLAGS.SW_WU2
// SW_WU1                   WUFLAGS.SW_WU1
// SW_WU0                   WUFLAGS.SW_WU0
// PROG_WU3                 WUFLAGS.PROG_WU3
// PROG_WU2                 WUFLAGS.PROG_WU2
// PROG_WU1                 WUFLAGS.PROG_WU1
// PROG_WU0                 WUFLAGS.PROG_WU0
// NONE                     Vector is disabled.
#define AUX_SYSIF_VECCFG4_VEC_EV_W                                           4
#define AUX_SYSIF_VECCFG4_VEC_EV_M                                  0x0000000F
#define AUX_SYSIF_VECCFG4_VEC_EV_S                                           0
#define AUX_SYSIF_VECCFG4_VEC_EV_AON_RTC_CH2_DLY                    0x00000009
#define AUX_SYSIF_VECCFG4_VEC_EV_SW_WU3                             0x00000008
#define AUX_SYSIF_VECCFG4_VEC_EV_SW_WU2                             0x00000007
#define AUX_SYSIF_VECCFG4_VEC_EV_SW_WU1                             0x00000006
#define AUX_SYSIF_VECCFG4_VEC_EV_SW_WU0                             0x00000005
#define AUX_SYSIF_VECCFG4_VEC_EV_PROG_WU3                           0x00000004
#define AUX_SYSIF_VECCFG4_VEC_EV_PROG_WU2                           0x00000003
#define AUX_SYSIF_VECCFG4_VEC_EV_PROG_WU1                           0x00000002
#define AUX_SYSIF_VECCFG4_VEC_EV_PROG_WU0                           0x00000001
#define AUX_SYSIF_VECCFG4_VEC_EV_NONE                               0x00000000

//*****************************************************************************
//
// Register: AUX_SYSIF_O_VECCFG5
//
//*****************************************************************************
// Field:   [3:0] VEC_EV
//
// Select trigger event for vector 5.
//
// Non-enumerated values are treated as NONE.
// ENUMs:
// AON_RTC_CH2_DLY          AUX_EVCTL:EVSTAT2.AON_RTC_CH2_DLY
// SW_WU3                   WUFLAGS.SW_WU3
// SW_WU2                   WUFLAGS.SW_WU2
// SW_WU1                   WUFLAGS.SW_WU1
// SW_WU0                   WUFLAGS.SW_WU0
// PROG_WU3                 WUFLAGS.PROG_WU3
// PROG_WU2                 WUFLAGS.PROG_WU2
// PROG_WU1                 WUFLAGS.PROG_WU1
// PROG_WU0                 WUFLAGS.PROG_WU0
// NONE                     Vector is disabled.
#define AUX_SYSIF_VECCFG5_VEC_EV_W                                           4
#define AUX_SYSIF_VECCFG5_VEC_EV_M                                  0x0000000F
#define AUX_SYSIF_VECCFG5_VEC_EV_S                                           0
#define AUX_SYSIF_VECCFG5_VEC_EV_AON_RTC_CH2_DLY                    0x00000009
#define AUX_SYSIF_VECCFG5_VEC_EV_SW_WU3                             0x00000008
#define AUX_SYSIF_VECCFG5_VEC_EV_SW_WU2                             0x00000007
#define AUX_SYSIF_VECCFG5_VEC_EV_SW_WU1                             0x00000006
#define AUX_SYSIF_VECCFG5_VEC_EV_SW_WU0                             0x00000005
#define AUX_SYSIF_VECCFG5_VEC_EV_PROG_WU3                           0x00000004
#define AUX_SYSIF_VECCFG5_VEC_EV_PROG_WU2                           0x00000003
#define AUX_SYSIF_VECCFG5_VEC_EV_PROG_WU1                           0x00000002
#define AUX_SYSIF_VECCFG5_VEC_EV_PROG_WU0                           0x00000001
#define AUX_SYSIF_VECCFG5_VEC_EV_NONE                               0x00000000

//*****************************************************************************
//
// Register: AUX_SYSIF_O_VECCFG6
//
//*****************************************************************************
// Field:   [3:0] VEC_EV
//
// Select trigger event for vector 6.
//
// Non-enumerated values are treated as NONE.
// ENUMs:
// AON_RTC_CH2_DLY          AUX_EVCTL:EVSTAT2.AON_RTC_CH2_DLY
// SW_WU3                   WUFLAGS.SW_WU3
// SW_WU2                   WUFLAGS.SW_WU2
// SW_WU1                   WUFLAGS.SW_WU1
// SW_WU0                   WUFLAGS.SW_WU0
// PROG_WU3                 WUFLAGS.PROG_WU3
// PROG_WU2                 WUFLAGS.PROG_WU2
// PROG_WU1                 WUFLAGS.PROG_WU1
// PROG_WU0                 WUFLAGS.PROG_WU0
// NONE                     Vector is disabled.
#define AUX_SYSIF_VECCFG6_VEC_EV_W                                           4
#define AUX_SYSIF_VECCFG6_VEC_EV_M                                  0x0000000F
#define AUX_SYSIF_VECCFG6_VEC_EV_S                                           0
#define AUX_SYSIF_VECCFG6_VEC_EV_AON_RTC_CH2_DLY                    0x00000009
#define AUX_SYSIF_VECCFG6_VEC_EV_SW_WU3                             0x00000008
#define AUX_SYSIF_VECCFG6_VEC_EV_SW_WU2                             0x00000007
#define AUX_SYSIF_VECCFG6_VEC_EV_SW_WU1                             0x00000006
#define AUX_SYSIF_VECCFG6_VEC_EV_SW_WU0                             0x00000005
#define AUX_SYSIF_VECCFG6_VEC_EV_PROG_WU3                           0x00000004
#define AUX_SYSIF_VECCFG6_VEC_EV_PROG_WU2                           0x00000003
#define AUX_SYSIF_VECCFG6_VEC_EV_PROG_WU1                           0x00000002
#define AUX_SYSIF_VECCFG6_VEC_EV_PROG_WU0                           0x00000001
#define AUX_SYSIF_VECCFG6_VEC_EV_NONE                               0x00000000

//*****************************************************************************
//
// Register: AUX_SYSIF_O_VECCFG7
//
//*****************************************************************************
// Field:   [3:0] VEC_EV
//
// Select trigger event for vector 7.
//
// Non-enumerated values are treated as NONE.
// ENUMs:
// AON_RTC_CH2_DLY          AUX_EVCTL:EVSTAT2.AON_RTC_CH2_DLY
// SW_WU3                   WUFLAGS.SW_WU3
// SW_WU2                   WUFLAGS.SW_WU2
// SW_WU1                   WUFLAGS.SW_WU1
// SW_WU0                   WUFLAGS.SW_WU0
// PROG_WU3                 WUFLAGS.PROG_WU3
// PROG_WU2                 WUFLAGS.PROG_WU2
// PROG_WU1                 WUFLAGS.PROG_WU1
// PROG_WU0                 WUFLAGS.PROG_WU0
// NONE                     Vector is disabled.
#define AUX_SYSIF_VECCFG7_VEC_EV_W                                           4
#define AUX_SYSIF_VECCFG7_VEC_EV_M                                  0x0000000F
#define AUX_SYSIF_VECCFG7_VEC_EV_S                                           0
#define AUX_SYSIF_VECCFG7_VEC_EV_AON_RTC_CH2_DLY                    0x00000009
#define AUX_SYSIF_VECCFG7_VEC_EV_SW_WU3                             0x00000008
#define AUX_SYSIF_VECCFG7_VEC_EV_SW_WU2                             0x00000007
#define AUX_SYSIF_VECCFG7_VEC_EV_SW_WU1                             0x00000006
#define AUX_SYSIF_VECCFG7_VEC_EV_SW_WU0                             0x00000005
#define AUX_SYSIF_VECCFG7_VEC_EV_PROG_WU3                           0x00000004
#define AUX_SYSIF_VECCFG7_VEC_EV_PROG_WU2                           0x00000003
#define AUX_SYSIF_VECCFG7_VEC_EV_PROG_WU1                           0x00000002
#define AUX_SYSIF_VECCFG7_VEC_EV_PROG_WU0                           0x00000001
#define AUX_SYSIF_VECCFG7_VEC_EV_NONE                               0x00000000

//*****************************************************************************
//
// Register: AUX_SYSIF_O_EVSYNCRATE
//
//*****************************************************************************
// Field:     [2] AUX_COMPA_SYNC_RATE
//
// Select synchronization rate for AUX_EVCTL:EVSTAT2.AUX_COMPA event.
// ENUMs:
// BUS_RATE                 AUX bus rate
// SCE_RATE                 SCE rate
#define AUX_SYSIF_EVSYNCRATE_AUX_COMPA_SYNC_RATE                    0x00000004
#define AUX_SYSIF_EVSYNCRATE_AUX_COMPA_SYNC_RATE_BITN                        2
#define AUX_SYSIF_EVSYNCRATE_AUX_COMPA_SYNC_RATE_M                  0x00000004
#define AUX_SYSIF_EVSYNCRATE_AUX_COMPA_SYNC_RATE_S                           2
#define AUX_SYSIF_EVSYNCRATE_AUX_COMPA_SYNC_RATE_BUS_RATE           0x00000004
#define AUX_SYSIF_EVSYNCRATE_AUX_COMPA_SYNC_RATE_SCE_RATE           0x00000000

// Field:     [1] AUX_COMPB_SYNC_RATE
//
// Select synchronization rate for AUX_EVCTL:EVSTAT2.AUX_COMPB event.
// ENUMs:
// BUS_RATE                 AUX bus rate
// SCE_RATE                 SCE rate
#define AUX_SYSIF_EVSYNCRATE_AUX_COMPB_SYNC_RATE                    0x00000002
#define AUX_SYSIF_EVSYNCRATE_AUX_COMPB_SYNC_RATE_BITN                        1
#define AUX_SYSIF_EVSYNCRATE_AUX_COMPB_SYNC_RATE_M                  0x00000002
#define AUX_SYSIF_EVSYNCRATE_AUX_COMPB_SYNC_RATE_S                           1
#define AUX_SYSIF_EVSYNCRATE_AUX_COMPB_SYNC_RATE_BUS_RATE           0x00000002
#define AUX_SYSIF_EVSYNCRATE_AUX_COMPB_SYNC_RATE_SCE_RATE           0x00000000

