nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/devices/cc13x2x7_cc26x2x7/inc/hw_aux_sysif.h
// Field:     [0] AUX_TIMER2_SYNC_RATE
//
// Select synchronization rate for:
// - AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV0
// - AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV1
// - AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV2
// - AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV3
// - AUX_EVCTL:EVSTAT3.AUX_TIMER2_PULSE
// ENUMs:
// BUS_RATE                 AUX bus rate
// SCE_RATE                 SCE rate
#define AUX_SYSIF_EVSYNCRATE_AUX_TIMER2_SYNC_RATE                   0x00000001
#define AUX_SYSIF_EVSYNCRATE_AUX_TIMER2_SYNC_RATE_BITN                       0
#define AUX_SYSIF_EVSYNCRATE_AUX_TIMER2_SYNC_RATE_M                 0x00000001
#define AUX_SYSIF_EVSYNCRATE_AUX_TIMER2_SYNC_RATE_S                          0
#define AUX_SYSIF_EVSYNCRATE_AUX_TIMER2_SYNC_RATE_BUS_RATE          0x00000001
#define AUX_SYSIF_EVSYNCRATE_AUX_TIMER2_SYNC_RATE_SCE_RATE          0x00000000

//*****************************************************************************
//
// Register: AUX_SYSIF_O_PEROPRATE
//
//*****************************************************************************
// Field:     [3] ANAIF_DAC_OP_RATE
//
// Select operational rate for AUX_ANAIF DAC sample clock state machine.
// ENUMs:
// BUS_RATE                 AUX bus rate
// SCE_RATE                 SCE rate
#define AUX_SYSIF_PEROPRATE_ANAIF_DAC_OP_RATE                       0x00000008
#define AUX_SYSIF_PEROPRATE_ANAIF_DAC_OP_RATE_BITN                           3
#define AUX_SYSIF_PEROPRATE_ANAIF_DAC_OP_RATE_M                     0x00000008
#define AUX_SYSIF_PEROPRATE_ANAIF_DAC_OP_RATE_S                              3
#define AUX_SYSIF_PEROPRATE_ANAIF_DAC_OP_RATE_BUS_RATE              0x00000008
#define AUX_SYSIF_PEROPRATE_ANAIF_DAC_OP_RATE_SCE_RATE              0x00000000

// Field:     [2] TIMER01_OP_RATE
//
// Select operational rate for AUX_TIMER01.
// ENUMs:
// BUS_RATE                 AUX bus rate
// SCE_RATE                 SCE rate
#define AUX_SYSIF_PEROPRATE_TIMER01_OP_RATE                         0x00000004
#define AUX_SYSIF_PEROPRATE_TIMER01_OP_RATE_BITN                             2
#define AUX_SYSIF_PEROPRATE_TIMER01_OP_RATE_M                       0x00000004
#define AUX_SYSIF_PEROPRATE_TIMER01_OP_RATE_S                                2
#define AUX_SYSIF_PEROPRATE_TIMER01_OP_RATE_BUS_RATE                0x00000004
#define AUX_SYSIF_PEROPRATE_TIMER01_OP_RATE_SCE_RATE                0x00000000

// Field:     [1] SPIM_OP_RATE
//
// Select operational rate for AUX_SPIM.
// ENUMs:
// BUS_RATE                 AUX bus rate
// SCE_RATE                 SCE rate
#define AUX_SYSIF_PEROPRATE_SPIM_OP_RATE                            0x00000002
#define AUX_SYSIF_PEROPRATE_SPIM_OP_RATE_BITN                                1
#define AUX_SYSIF_PEROPRATE_SPIM_OP_RATE_M                          0x00000002
#define AUX_SYSIF_PEROPRATE_SPIM_OP_RATE_S                                   1
#define AUX_SYSIF_PEROPRATE_SPIM_OP_RATE_BUS_RATE                   0x00000002
#define AUX_SYSIF_PEROPRATE_SPIM_OP_RATE_SCE_RATE                   0x00000000

// Field:     [0] MAC_OP_RATE
//
// Select operational rate for AUX_MAC.
// ENUMs:
// BUS_RATE                 AUX bus rate
// SCE_RATE                 SCE rate
#define AUX_SYSIF_PEROPRATE_MAC_OP_RATE                             0x00000001
#define AUX_SYSIF_PEROPRATE_MAC_OP_RATE_BITN                                 0
#define AUX_SYSIF_PEROPRATE_MAC_OP_RATE_M                           0x00000001
#define AUX_SYSIF_PEROPRATE_MAC_OP_RATE_S                                    0
#define AUX_SYSIF_PEROPRATE_MAC_OP_RATE_BUS_RATE                    0x00000001
#define AUX_SYSIF_PEROPRATE_MAC_OP_RATE_SCE_RATE                    0x00000000

//*****************************************************************************
//
// Register: AUX_SYSIF_O_ADCCLKCTL
//
//*****************************************************************************
// Field:     [1] ACK
//
// Clock acknowledgement.
//
// 0: ADC clock is disabled.
// 1: ADC clock is enabled.
#define AUX_SYSIF_ADCCLKCTL_ACK                                     0x00000002
#define AUX_SYSIF_ADCCLKCTL_ACK_BITN                                         1
#define AUX_SYSIF_ADCCLKCTL_ACK_M                                   0x00000002
#define AUX_SYSIF_ADCCLKCTL_ACK_S                                            1

// Field:     [0] REQ
//
// ADC clock request.
//
// 0: Disable ADC clock.
// 1: Enable ADC clock.
//
// Only modify REQ when equal to ACK.
#define AUX_SYSIF_ADCCLKCTL_REQ                                     0x00000001
#define AUX_SYSIF_ADCCLKCTL_REQ_BITN                                         0
#define AUX_SYSIF_ADCCLKCTL_REQ_M                                   0x00000001
#define AUX_SYSIF_ADCCLKCTL_REQ_S                                            0

//*****************************************************************************
//
// Register: AUX_SYSIF_O_TDCCLKCTL
//
//*****************************************************************************
// Field:     [1] ACK
//
// TDC counter clock acknowledgement.
//
// 0: TDC counter clock is disabled.
// 1: TDC counter clock is enabled.
#define AUX_SYSIF_TDCCLKCTL_ACK                                     0x00000002
#define AUX_SYSIF_TDCCLKCTL_ACK_BITN                                         1
#define AUX_SYSIF_TDCCLKCTL_ACK_M                                   0x00000002
#define AUX_SYSIF_TDCCLKCTL_ACK_S                                            1

// Field:     [0] REQ
//
// TDC counter clock request.
//
// 0: Disable TDC counter clock.
// 1: Enable TDC counter clock.
//
// Only modify REQ when equal to ACK.
#define AUX_SYSIF_TDCCLKCTL_REQ                                     0x00000001
#define AUX_SYSIF_TDCCLKCTL_REQ_BITN                                         0
#define AUX_SYSIF_TDCCLKCTL_REQ_M                                   0x00000001
#define AUX_SYSIF_TDCCLKCTL_REQ_S                                            0

//*****************************************************************************
//
// Register: AUX_SYSIF_O_TDCREFCLKCTL
//
//*****************************************************************************
// Field:     [1] ACK
//
// TDC reference clock acknowledgement.
//
// 0: TDC reference clock is disabled.
// 1: TDC reference clock is enabled.
#define AUX_SYSIF_TDCREFCLKCTL_ACK                                  0x00000002
#define AUX_SYSIF_TDCREFCLKCTL_ACK_BITN                                      1
#define AUX_SYSIF_TDCREFCLKCTL_ACK_M                                0x00000002
#define AUX_SYSIF_TDCREFCLKCTL_ACK_S                                         1

// Field:     [0] REQ
//
// TDC reference clock request.
//
// 0: Disable TDC reference clock.
// 1: Enable TDC reference clock.
//
// Only modify REQ when equal to ACK.
#define AUX_SYSIF_TDCREFCLKCTL_REQ                                  0x00000001
#define AUX_SYSIF_TDCREFCLKCTL_REQ_BITN                                      0
#define AUX_SYSIF_TDCREFCLKCTL_REQ_M                                0x00000001
#define AUX_SYSIF_TDCREFCLKCTL_REQ_S                                         0

//*****************************************************************************
//
// Register: AUX_SYSIF_O_TIMER2CLKCTL
//
//*****************************************************************************
// Field:   [2:0] SRC
//
// Select clock source for AUX_TIMER2.
//
// Update is only accepted if SRC equals TIMER2CLKSTAT.STAT or
// TIMER2CLKSWITCH.RDY is 1.
//
// It is recommended to select NONE only when TIMER2BRIDGE.BUSY is 0.
//
// A non-enumerated value is ignored.
// ENUMs:
// SCLK_HFDIV2              SCLK_HF / 2
// SCLK_MF                  SCLK_MF
// SCLK_LF                  SCLK_LF
// NONE                     no clock
#define AUX_SYSIF_TIMER2CLKCTL_SRC_W                                         3
#define AUX_SYSIF_TIMER2CLKCTL_SRC_M                                0x00000007
#define AUX_SYSIF_TIMER2CLKCTL_SRC_S                                         0
#define AUX_SYSIF_TIMER2CLKCTL_SRC_SCLK_HFDIV2                      0x00000004
#define AUX_SYSIF_TIMER2CLKCTL_SRC_SCLK_MF                          0x00000002
#define AUX_SYSIF_TIMER2CLKCTL_SRC_SCLK_LF                          0x00000001
#define AUX_SYSIF_TIMER2CLKCTL_SRC_NONE                             0x00000000

//*****************************************************************************
//
// Register: AUX_SYSIF_O_TIMER2CLKSTAT
//
//*****************************************************************************
// Field:   [2:0] STAT
//
// AUX_TIMER2 clock source status.
// ENUMs:
// SCLK_HFDIV2              SCLK_HF / 2
// SCLK_MF                  SCLK_MF
// SCLK_LF                  SCLK_LF
// NONE                     No clock
#define AUX_SYSIF_TIMER2CLKSTAT_STAT_W                                       3
#define AUX_SYSIF_TIMER2CLKSTAT_STAT_M                              0x00000007
#define AUX_SYSIF_TIMER2CLKSTAT_STAT_S                                       0
#define AUX_SYSIF_TIMER2CLKSTAT_STAT_SCLK_HFDIV2                    0x00000004
#define AUX_SYSIF_TIMER2CLKSTAT_STAT_SCLK_MF                        0x00000002
#define AUX_SYSIF_TIMER2CLKSTAT_STAT_SCLK_LF                        0x00000001
#define AUX_SYSIF_TIMER2CLKSTAT_STAT_NONE                           0x00000000

//*****************************************************************************
//
// Register: AUX_SYSIF_O_TIMER2CLKSWITCH
//
//*****************************************************************************
// Field:     [0] RDY
//
// Status of clock switcher.
//
// 0: TIMER2CLKCTL.SRC is different from TIMER2CLKSTAT.STAT.
// 1: TIMER2CLKCTL.SRC equals TIMER2CLKSTAT.STAT.
//
// RDY connects to AUX_EVCTL:EVSTAT3.AUX_TIMER2_CLKSWITCH_RDY.
#define AUX_SYSIF_TIMER2CLKSWITCH_RDY                               0x00000001
#define AUX_SYSIF_TIMER2CLKSWITCH_RDY_BITN                                   0
#define AUX_SYSIF_TIMER2CLKSWITCH_RDY_M                             0x00000001
#define AUX_SYSIF_TIMER2CLKSWITCH_RDY_S                                      0

//*****************************************************************************
//
// Register: AUX_SYSIF_O_TIMER2DBGCTL
//
//*****************************************************************************
// Field:     [0] DBG_FREEZE_EN
//
// Debug freeze enable.
//
// 0: AUX_TIMER2 does not halt when the system CPU halts in debug mode.
// 1: Halt AUX_TIMER2 when the system CPU halts in debug mode.
#define AUX_SYSIF_TIMER2DBGCTL_DBG_FREEZE_EN                        0x00000001
#define AUX_SYSIF_TIMER2DBGCTL_DBG_FREEZE_EN_BITN                            0
#define AUX_SYSIF_TIMER2DBGCTL_DBG_FREEZE_EN_M                      0x00000001
#define AUX_SYSIF_TIMER2DBGCTL_DBG_FREEZE_EN_S                               0

//*****************************************************************************
//
// Register: AUX_SYSIF_O_CLKSHIFTDET
//
//*****************************************************************************
// Field:     [0] STAT
//
// Clock shift detection.
//
// Write:
//
// 0: Restart clock shift detection.
// 1: Do not use.
//
// Read:
//
// 0: MCU domain did not enter or exit active state since you wrote 0 to STAT.
// 1: MCU domain entered or exited active state since you wrote 0 to STAT.
#define AUX_SYSIF_CLKSHIFTDET_STAT                                  0x00000001
#define AUX_SYSIF_CLKSHIFTDET_STAT_BITN                                      0
#define AUX_SYSIF_CLKSHIFTDET_STAT_M                                0x00000001
#define AUX_SYSIF_CLKSHIFTDET_STAT_S                                         0

//*****************************************************************************
//
// Register: AUX_SYSIF_O_RECHARGETRIG
//
//*****************************************************************************
// Field:     [0] TRIG
//
// Recharge trigger.
//
// 0: No effect.
// 1: Request VDDR recharge.
//
// Request VDDR recharge only when AUX_EVCTL:EVSTAT2.PWR_DWN is 1.
//
// Follow this sequence when OPMODEREQ.REQ is LP:
// - Set TRIG.
// - Wait until AUX_EVCTL:EVSTAT2.VDDR_RECHARGE is 1.
// - Clear TRIG.
// - Wait until AUX_EVCTL:EVSTAT2.VDDR_RECHARGE is 0.
//
// Follow this sequence when OPMODEREQ.REQ is PDA or PDLP:
// - Set TRIG.
// - Clear TRIG.
#define AUX_SYSIF_RECHARGETRIG_TRIG                                 0x00000001
#define AUX_SYSIF_RECHARGETRIG_TRIG_BITN                                     0
#define AUX_SYSIF_RECHARGETRIG_TRIG_M                               0x00000001
#define AUX_SYSIF_RECHARGETRIG_TRIG_S                                        0

//*****************************************************************************
//
// Register: AUX_SYSIF_O_RECHARGEDET
//
//*****************************************************************************
// Field:     [1] STAT
//
// VDDR recharge detector status.
//
// 0: No recharge of VDDR has occurred since EN was set.
// 1: Recharge of VDDR has occurred since EN was set.
#define AUX_SYSIF_RECHARGEDET_STAT                                  0x00000002
#define AUX_SYSIF_RECHARGEDET_STAT_BITN                                      1
#define AUX_SYSIF_RECHARGEDET_STAT_M                                0x00000002
#define AUX_SYSIF_RECHARGEDET_STAT_S                                         1

// Field:     [0] EN
//
// VDDR recharge detector enable.
//
// 0: Disable recharge detection. STAT becomes zero.
// 1: Enable recharge detection.
#define AUX_SYSIF_RECHARGEDET_EN                                    0x00000001
#define AUX_SYSIF_RECHARGEDET_EN_BITN                                        0
#define AUX_SYSIF_RECHARGEDET_EN_M                                  0x00000001
#define AUX_SYSIF_RECHARGEDET_EN_S                                           0

//*****************************************************************************
//
// Register: AUX_SYSIF_O_RTCSUBSECINC0
//
//*****************************************************************************
// Field:  [15:0] INC15_0
//
// New value for bits 15:0 in AON_RTC:SUBSECINC.
#define AUX_SYSIF_RTCSUBSECINC0_INC15_0_W                                   16
#define AUX_SYSIF_RTCSUBSECINC0_INC15_0_M                           0x0000FFFF
#define AUX_SYSIF_RTCSUBSECINC0_INC15_0_S                                    0

//*****************************************************************************
//
// Register: AUX_SYSIF_O_RTCSUBSECINC1
//
//*****************************************************************************
// Field:   [7:0] INC23_16
//
// New value for bits 23:16 in AON_RTC:SUBSECINC.
#define AUX_SYSIF_RTCSUBSECINC1_INC23_16_W                                   8
#define AUX_SYSIF_RTCSUBSECINC1_INC23_16_M                          0x000000FF
#define AUX_SYSIF_RTCSUBSECINC1_INC23_16_S                                   0

//*****************************************************************************
//
// Register: AUX_SYSIF_O_RTCSUBSECINCCTL
//
//*****************************************************************************
// Field:     [1] UPD_ACK
//
// Update acknowledgement.
//
// 0: AON_RTC has not acknowledged UPD_REQ.
// 1: AON_RTC has acknowledged UPD_REQ.
#define AUX_SYSIF_RTCSUBSECINCCTL_UPD_ACK                           0x00000002
#define AUX_SYSIF_RTCSUBSECINCCTL_UPD_ACK_BITN                               1
#define AUX_SYSIF_RTCSUBSECINCCTL_UPD_ACK_M                         0x00000002
#define AUX_SYSIF_RTCSUBSECINCCTL_UPD_ACK_S                                  1

// Field:     [0] UPD_REQ
//
// Request AON_RTC to update AON_RTC:SUBSECINC.
//
// 0: Clear request to update.
// 1: Set request to update.
//
// Only change UPD_REQ when it equals UPD_ACK. Clear UPD_REQ after UPD_ACK is
// 1.
#define AUX_SYSIF_RTCSUBSECINCCTL_UPD_REQ                           0x00000001
#define AUX_SYSIF_RTCSUBSECINCCTL_UPD_REQ_BITN                               0
#define AUX_SYSIF_RTCSUBSECINCCTL_UPD_REQ_M                         0x00000001
#define AUX_SYSIF_RTCSUBSECINCCTL_UPD_REQ_S                                  0

//*****************************************************************************
//
// Register: AUX_SYSIF_O_RTCSEC
//
//*****************************************************************************
// Field:  [15:0] SEC
//
// Bits 15:0 in AON_RTC:SEC.VALUE.
//
// Follow this procedure to get the correct value:
// - Do two dummy reads of SEC.
// - Then read SEC until two consecutive reads are equal.
#define AUX_SYSIF_RTCSEC_SEC_W                                              16
#define AUX_SYSIF_RTCSEC_SEC_M                                      0x0000FFFF
#define AUX_SYSIF_RTCSEC_SEC_S                                               0

//*****************************************************************************
//
// Register: AUX_SYSIF_O_RTCSUBSEC
//
//*****************************************************************************
// Field:  [15:0] SUBSEC
//
// Bits 31:16 in AON_RTC:SUBSEC.VALUE.
//
// Follow this procedure to get the correct value:
// - Do two dummy reads SUBSEC.
// - Then read SUBSEC until two consecutive reads are equal.
#define AUX_SYSIF_RTCSUBSEC_SUBSEC_W                                        16
#define AUX_SYSIF_RTCSUBSEC_SUBSEC_M                                0x0000FFFF
#define AUX_SYSIF_RTCSUBSEC_SUBSEC_S                                         0

//*****************************************************************************
//
// Register: AUX_SYSIF_O_RTCEVCLR
//
//*****************************************************************************
// Field:     [0] RTC_CH2_EV_CLR
//
// Clear events from AON_RTC channel 2.
//
// 0: No effect.
// 1: Clear events from AON_RTC channel 2.
//
// Keep RTC_CH2_EV_CLR high until AUX_EVCTL:EVSTAT2.AON_RTC_CH2 and
// AUX_EVCTL:EVSTAT2.AON_RTC_CH2_DLY are 0.
#define AUX_SYSIF_RTCEVCLR_RTC_CH2_EV_CLR                           0x00000001
#define AUX_SYSIF_RTCEVCLR_RTC_CH2_EV_CLR_BITN                               0
#define AUX_SYSIF_RTCEVCLR_RTC_CH2_EV_CLR_M                         0x00000001
#define AUX_SYSIF_RTCEVCLR_RTC_CH2_EV_CLR_S                                  0

//*****************************************************************************
//
// Register: AUX_SYSIF_O_BATMONBAT
//
//*****************************************************************************
// Field:  [10:8] INT
//
// See AON_BATMON:BAT.INT.
//
// Follow this procedure to get the correct value:
// - Do two dummy reads of INT.
// - Then read INT until two consecutive reads are equal.
#define AUX_SYSIF_BATMONBAT_INT_W                                            3
#define AUX_SYSIF_BATMONBAT_INT_M                                   0x00000700
#define AUX_SYSIF_BATMONBAT_INT_S                                            8

// Field:   [7:0] FRAC
//
// See AON_BATMON:BAT.FRAC.
//
// Follow this procedure to get the correct value:
// - Do two dummy reads of FRAC.
// - Then read FRAC until two consecutive reads are equal.
#define AUX_SYSIF_BATMONBAT_FRAC_W                                           8
#define AUX_SYSIF_BATMONBAT_FRAC_M                                  0x000000FF
#define AUX_SYSIF_BATMONBAT_FRAC_S                                           0

//*****************************************************************************
//
// Register: AUX_SYSIF_O_BATMONTEMP
//
//*****************************************************************************
// Field: [15:11] SIGN
//
// Sign extension of INT.
//
// Follow this procedure to get the correct value:
// - Do two dummy reads of SIGN.
// - Then read SIGN until two consecutive reads are equal.
#define AUX_SYSIF_BATMONTEMP_SIGN_W                                          5
#define AUX_SYSIF_BATMONTEMP_SIGN_M                                 0x0000F800
#define AUX_SYSIF_BATMONTEMP_SIGN_S                                         11

// Field:  [10:2] INT
//
// See AON_BATMON:TEMP.INT.
//
// Follow this procedure to get the correct value:
// - Do two dummy reads of INT.
// - Then read INT until two consecutive reads are equal.
#define AUX_SYSIF_BATMONTEMP_INT_W                                           9
#define AUX_SYSIF_BATMONTEMP_INT_M                                  0x000007FC
#define AUX_SYSIF_BATMONTEMP_INT_S                                           2

// Field:   [1:0] FRAC
//
// See AON_BATMON:TEMP.FRAC.
//
// Follow this procedure to get the correct value:
// - Do two dummy reads of FRAC.
// - Then read FRAC until two consecutive reads are equal.
#define AUX_SYSIF_BATMONTEMP_FRAC_W                                          2
#define AUX_SYSIF_BATMONTEMP_FRAC_M                                 0x00000003
#define AUX_SYSIF_BATMONTEMP_FRAC_S                                          0

//*****************************************************************************
//
// Register: AUX_SYSIF_O_TIMERHALT
//
//*****************************************************************************
// Field:     [3] PROGDLY
//
// Halt programmable delay.
//
// 0: AUX_EVCTL:PROGDLY.VALUE decrements as normal.
// 1: Halt AUX_EVCTL:PROGDLY.VALUE decrementation.
#define AUX_SYSIF_TIMERHALT_PROGDLY                                 0x00000008
#define AUX_SYSIF_TIMERHALT_PROGDLY_BITN                                     3
#define AUX_SYSIF_TIMERHALT_PROGDLY_M                               0x00000008
#define AUX_SYSIF_TIMERHALT_PROGDLY_S                                        3

// Field:     [2] AUX_TIMER2
//
// Halt AUX_TIMER2.
//
// 0: AUX_TIMER2 operates as normal.
// 1: Halt AUX_TIMER2 operation.
#define AUX_SYSIF_TIMERHALT_AUX_TIMER2                              0x00000004
#define AUX_SYSIF_TIMERHALT_AUX_TIMER2_BITN                                  2
#define AUX_SYSIF_TIMERHALT_AUX_TIMER2_M                            0x00000004
#define AUX_SYSIF_TIMERHALT_AUX_TIMER2_S                                     2

// Field:     [1] AUX_TIMER1
//
// Halt AUX_TIMER01 Timer 1.
//
// 0: AUX_TIMER01 Timer 1 operates as normal.
// 1: Halt AUX_TIMER01 Timer 1 operation.
#define AUX_SYSIF_TIMERHALT_AUX_TIMER1                              0x00000002
#define AUX_SYSIF_TIMERHALT_AUX_TIMER1_BITN                                  1
#define AUX_SYSIF_TIMERHALT_AUX_TIMER1_M                            0x00000002
#define AUX_SYSIF_TIMERHALT_AUX_TIMER1_S                                     1

