nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/devices/cc13x2x7_cc26x2x7/inc/hw_aux_sysif.h
// Field:     [0] AUX_TIMER0
//
// Halt AUX_TIMER01 Timer 0.
//
// 0: AUX_TIMER01 Timer 0 operates as normal.
// 1: Halt AUX_TIMER01 Timer 0 operation.
#define AUX_SYSIF_TIMERHALT_AUX_TIMER0                              0x00000001
#define AUX_SYSIF_TIMERHALT_AUX_TIMER0_BITN                                  0
#define AUX_SYSIF_TIMERHALT_AUX_TIMER0_M                            0x00000001
#define AUX_SYSIF_TIMERHALT_AUX_TIMER0_S                                     0

//*****************************************************************************
//
// Register: AUX_SYSIF_O_TIMER2BRIDGE
//
//*****************************************************************************
// Field:     [0] BUSY
//
// Status of bus transactions to AUX_TIMER2.
//
// 0: No unfinished bus transactions.
// 1: A bus transaction is ongoing.
#define AUX_SYSIF_TIMER2BRIDGE_BUSY                                 0x00000001
#define AUX_SYSIF_TIMER2BRIDGE_BUSY_BITN                                     0
#define AUX_SYSIF_TIMER2BRIDGE_BUSY_M                               0x00000001
#define AUX_SYSIF_TIMER2BRIDGE_BUSY_S                                        0

//*****************************************************************************
//
// Register: AUX_SYSIF_O_SWPWRPROF
//
//*****************************************************************************
// Field:   [2:0] STAT
//
// Software status bits that can be read by the power profiler.
#define AUX_SYSIF_SWPWRPROF_STAT_W                                           3
#define AUX_SYSIF_SWPWRPROF_STAT_M                                  0x00000007
#define AUX_SYSIF_SWPWRPROF_STAT_S                                           0


#endif // __AUX_SYSIF__
